// отправка писем из очереци
Процедура ОтправкаПисемИзОчереди() Экспорт
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	ДатаОтправки = Дата(ТекущаяДата());
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 5
		|	Очередь.Рассылка КАК Рассылка,
		|	Очередь.Контрагент КАК Контрагент,
		|	Очередь.УчетнаяЗаписьЭП КАК УчетнаяЗаписьЭП,
		|	Очередь.ДатаОтправки КАК ДатаОтправки
		|ИЗ
		|	РегистрСведений.Очередь КАК Очередь
		|ГДЕ
		|	Очередь.ДатаОтправки <= &ДатаОтправки
		|ДЛЯ ИЗМЕНЕНИЯ
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОтправки,
		|	Рассылка,
		|	Контрагент,
		|	УчетнаяЗаписьЭП";
	
	Запрос.УстановитьПараметр("ДатаОтправки", ДатаОтправки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить(ВыборкаДетальныеЗаписи.ИмяПоля)
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецПроцедуры