&НаКлиенте
Процедура ОтправитьПисьмаВОчередь(Команда)
	Если не ЗначениеЗаполнено(Объект.Ссылка) тогда
		ПоказатьПредупреждение(,"Перед отправкой сохраните рассылку", 10);
		//если пармаетры были изменены, в случае повторной 
		//отправки писем в очередь они изменятся и там тоже
	Иначе ОтправитьПисьмаВОчередьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьмаВОчередьНаСервере()
	
	Контрагенты = новый Массив;
	Выборка = Объект.Получатели.Состав;
	
	Для каждого к из Выборка цикл
		Контрагенты.Добавить(к.Контрагент.Ссылка);
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из Контрагенты Цикл 
		МенеджерЗаписи = РегистрыСведений.Очередь.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Рассылка = Объект.Ссылка;
		МенеджерЗаписи.Контрагент = СтрокаТаблицы;
		МенеджерЗаписи.УчетнаяЗаписьЭП = Объект.УчетнаяЗапись;
		МенеджерЗаписи.ДатаОтправки = Объект.ДатаОтправки;
		МенеджерЗаписи.Записать();
		
	КонецЦикла; 
КонецПроцедуры


