&НаКлиенте
Процедура ОтправитьПисьмаВОчередь(Команда)
	Если не ЗначениеЗаполнено(Объект.Ссылка) тогда
		ПоказатьПредупреждение(,"Перед отправкой сохраните рассылку", 10);
		//TODO: что делать в случае повтороной отправки
	Иначе ОтправитьПисьмаВОчередьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьмаВОчередьНаСервере()
	//TODO: Вставить содержимое обработчика про отправку в очередь
//	НаборЗаписей = РегистрыСведений.Очередь.СоздатьНаборЗаписей();
//	НаборЗаписей.Отбор.Рассылка.Установить();
//	НаборЗаписей.Отбор.Контрагент.Установить();
	Контрагенты = новый Массив;
	//Объект.Получатели.Состав;
	Выборка = Объект.Получатели.Состав;
	Для каждого к из Выборка цикл
		Контрагенты.Добавить(к.Контрагент.Ссылка);
		//Попытка Сообщить(к.Контрагент.КонтактнаяИнформация[0].Тип)
		//Исключение Сообщить("Нет ЭП");
		//КонецПопытки;
	КонецЦикла;
	Сообщить(Контрагенты.Количество());
	
	Для Каждого СтрокаТаблицы Из Контрагенты Цикл 
		МенеджерЗаписи = РегистрыСведений.Очередь.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Рассылка = Объект.Ссылка;
		МенеджерЗаписи.Контрагент = СтрокаТаблицы;
		МенеджерЗаписи.УчетнаяЗаписьЭП = Объект.УчетнаяЗапись;
		МенеджерЗаписи.ДатаОтправки = Объект.ДатаОтправки;
		МенеджерЗаписи.Записать();
//	   НоваяЗапись = НаборЗаписей.Добавить(); 
//	   НоваяЗапись.Рассылка = ЭтотОбъект.Объект.Ссылка; 
//	   НоваяЗапись.Контрагент = СтрокаТаблицы; 
//	   НоваяЗапись.ДатаОтправки = Объект.ДатаОтправки; 
	КонецЦикла; 
//	НаборЗаписей.Записать();
	//Для Каждого контрагент из Контрагенты цикл
КонецПроцедуры
