

&НаКлиенте
Процедура ОбработатьОшибкиИОтказы(Команда)
	ОбработатьОшибкиИОтказыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбработатьОшибкиИОтказыНаСервере()
	
	УчЗапись = Справочники.УчётныеЗаписиЭП.Выбрать();
	
	Пока УчЗапись.Следующий() Цикл
		сообщить(УчЗапись.АдресЭП);
		Профиль = ПолучитьПрофиль(УчЗапись);
		Почта = ПодключитьсяКПочте(Профиль);
		
		МассивСообщений = новый Массив;
		МассивСообщений = Почта.Выбрать(Ложь);
		Для Индекс=0 по МассивСообщений.Количество() - 1 Цикл
		
		Сообщение = МассивСообщений[Индекс];
		Тема = Сообщение.Тема;
		Отправитель = Сообщение.Отправитель;
		заг = Сообщение.;
		Если (СтрНайти(НСтр(Тема), "отпис")) Тогда
			НаборЗаписей = РегистрыСведений.ПротоколОтправки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.АдресЭПКонтрагента.Установить(Отправитель);
			НаборЗаписей.Прочитать();
			Для каждого Запись из НаборЗаписей Цикл
				Запись.ДопРезультат="Отписка"
			КонецЦикла;
			НаборЗаписей.Записать();
//			МенеджерЗаписи = РегистрыСведений.ПротоколОтправки.СоздатьМенеджерЗаписи();
//			МенеджерЗаписи.АдресЭПКонтрагента=Отправитель;

		Иначе Если (СтрНайти(НСтр(Отправитель), "mailer-daemon")) Тогда
			МенеджерЗаписи = РегистрыСведений.ПротоколОтправки.СоздатьМенеджерЗаписи();
			// TODO: извлекать email из текста письма демона	
			
		КонецЕсли;
			// TODO: ???
		КонецЕсли;
		Сообщить(Сообщение.Тема);
	КонецЦикла;
		
		
		ОтключитьсяОтПочты(Почта);
	КонецЦикла;
	
	

	//TODO: считать письма из ящика
	//TODO: по теме письма определить куда отправлять (какой статус)
	//TODO: изменить доп статус письма в регистре или сам статус если нет ящика
КонецПроцедуры

Функция ПодключитьсяКПочте(Профиль)	
	Почта = Новый ИнтернетПочта;
	Попытка
	Почта.Подключиться(Профиль);
	Сообщить("Подключение к профилю прошло успешно");
	Исключение
	Сообщить(ОписаниеОшибки()); 
	Возврат 0;
	КонецПопытки;

	Сообщить("Процедура на сервере завершена");
	Возврат Почта;
КонецФункции

Процедура ОтключитьсяОтПочты(Почта)
	Почта.Отключиться(); 
	Сообщить("Отключение от почты");
КонецПроцедуры


Функция ПолучитьПрофиль(УчЗапись)
Профиль = Новый ИнтернетПочтовыйПрофиль;
Профиль.АдресСервераSMTP = УчЗапись.СерверSMTP;
Профиль.ПортSMTP = УчЗапись.ПортSMTP;
Профиль.ИспользоватьSSLSMTP = Истина;
Профиль.Пользователь = УчЗапись.АдресЭП;
Профиль.Пароль = УчЗапись.Пароль;
Профиль.ПользовательSMTP = УчЗапись.АдресЭП;
Профиль.ПарольSMTP = УчЗапись.Пароль;
Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;

Профиль.АдресСервераIMAP = УчЗапись.СерверIMAP;
Профиль.ПортIMAP = УчЗапись.ПортIMAP;
Профиль.ИспользоватьSSLIMAP = Истина;
Профиль.ТолькоЗащищеннаяАутентификацияIMAP = Ложь;
Профиль.ПользовательIMAP = УчЗапись.АдресЭП;
Профиль.ПарольIMAP = УчЗапись.Пароль;

Профиль.АдресСервераPOP3 = УчЗапись.СерверPOP3;
Профиль.ПортPOP3 = УчЗапись.ПортPOP3;
Профиль.ИспользоватьSSLPOP3 = Истина;
Профиль.ТолькоЗащищеннаяАутентификацияPOP3 = Ложь;

Профиль.ВремяОжидания = 50; 

Возврат Профиль;
КонецФункции