

Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	Если ТребуемыеПараметры = неопределено Тогда
		ИмяП = ИмяПользователя();
		ИмяП = ?(ИмяП="","1",ИмяП);
		ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию(ИмяП);
		Если ПользовательСсылка.Пустая() Тогда
			НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
			НовыйПользователь.Наименование = ИмяП;
			НовыйПользователь.Записать();
			ПользовательСсылка = НовыйПользователь.Ссылка;			
		КонецЕсли;
		ПараметрыСеанса.ТекущийПользователь = ПользовательСсылка;
	КонецЕсли; 
КонецПроцедуры
