

&НаКлиенте
Процедура ПроверитьОтписку(Команда)
	ПроверитьОтпискуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьОтпискуНаСервере()
	Отправитель = "mari.aleo@yandex.ru";
	НаборЗаписей = РегистрыСведений.ПротоколОтправки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.АдресЭПКонтрагента.Установить(Отправитель);
	НаборЗаписей.Прочитать();
	Запись = НаборЗаписей[0];
	Запись.ДопРезультат="Отписка";
	//Для каждого Запись из НаборЗаписей Цикл	
//	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры
