Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаРассылку") Тогда
		Если НЕ ДанныеЗаполнения.Статус = Перечисления.СтатусыЗаявок.ВРаботе Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Неверный статус заявки'");
			//Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			//TODO: отменить создание рассылки при таких статусах заявок
		КонецЕсли;
		// Заполнение шапки
		ТемаПисьма = ДанныеЗаполнения.Наименование;
		Заявка = ДанныеЗаполнения.Ссылка;

	КонецЕсли;

	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ

КонецПроцедуры