Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаРассылку") Тогда
		
		Если НЕ ДанныеЗаполнения.Статус = Перечисления.СтатусыЗаявок.ВРаботе Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Неверный статус заявки";
			Сообщение.Сообщить();
		КонецЕсли;
		
		ТемаРассылки = ДанныеЗаполнения.Наименование;
		Заявка = ДанныеЗаполнения.Ссылка;

	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если (не Заявка.Статус = Перечисления.СтатусыЗаявок.ВРаботе) тогда
		Сообщить("Невозможно создать или изменить рассылку по несогласованной или завершенной заявке");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры



