

&НаКлиенте
Процедура ОбработатьНеДоставленные(Команда)
	ОбработатьНеДоставленныеНаСервере();
КонецПроцедуры

&НаСервере

Функция ПолучитьПрофиль()
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераSMTP = "smtp.gmail.com";
	Профиль.ПортSMTP = 465;
	Профиль.ИспользоватьSSLSMTP = Истина;
	Профиль.Пользователь = "1cservicesspb@gmail.com";
	Профиль.Пароль = "Maridiplom2";
	Профиль.ПользовательSMTP = "1cservicesspb@gmail.com";
	Профиль.ПарольSMTP = "Maridiplom2";
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	
	Профиль.АдресСервераIMAP = "imap.gmail.com";
	Профиль.ПортIMAP = 993;
	Профиль.ИспользоватьSSLIMAP = Истина;
	Профиль.ТолькоЗащищеннаяАутентификацияIMAP = Ложь;
	Профиль.ПользовательIMAP = "1cservicesspb@gmail.com";
	Профиль.ПарольIMAP = "Maridiplom2";
	
	Профиль.АдресСервераPOP3 = "pop.gmail.com";
	Профиль.ПортPOP3 = 995;
	Профиль.ИспользоватьSSLPOP3 = Истина;
	Профиль.ТолькоЗащищеннаяАутентификацияPOP3 = Ложь;

	Профиль.ВремяОжидания = 50; 
	
	Возврат Профиль;
КонецФункции

Процедура ОбработатьНеДоставленныеНаСервере()
	Почта = Новый ИнтернетПочта;
	Попытка
	Почта.Подключиться(ПолучитьПрофиль());
	Сообщить("Подключение к профилю прошло успешно");
	Исключение
	Сообщить(ОписаниеОшибки()); 
	Возврат;
	КонецПопытки;
	
	МассивСообщений = новый Массив;
	МассивСообщений = Почта.Выбрать(Ложь);
	Сообщить(МассивСообщений.Количество());
	Для Индекс=0 по МассивСообщений.Количество() - 1 Цикл
		Сообщить("В цикле");
		соо = МассивСообщений[Индекс];
		Сообщить(соо.Тема);
	КонецЦикла;
	Почта.Отключиться(); 
	
	Сообщ = новый СообщениеПользователю();
	Сообщ.Текст = "Процедура на сервере завершена";
	Сообщ.Сообщить();

КонецПроцедуры
