

&НаКлиенте
Процедура ОтправитьПисьмо(Команда)
	ОтправитьПисьмоНаСервере();
КонецПроцедуры

&НаСервере

Функция ПолучитьПрофиль()
Профиль = Новый ИнтернетПочтовыйПрофиль;
Профиль.АдресСервераSMTP = "smtp.gmail.com";
Профиль.ПортSMTP = 465;
Профиль.ИспользоватьSSLSMTP = Истина;
Профиль.Пользователь = "1cservicesspb@gmail.com";
Профиль.Пароль = "Maridiplom2";
Профиль.ПользовательSMTP = "1cservicesspb@gmail.com";
Профиль.ПарольSMTP = "Maridiplom2";
Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
Профиль.ВремяОжидания = 50; 

Возврат Профиль;
КонецФункции

Процедура ОтправитьПисьмоНаСервере()
	
	Почта = Новый ИнтернетПочта;
	Попытка
	Почта.Подключиться(ПолучитьПрофиль());
	Сообщить("Подключение к профилю");
	Исключение
	Сообщить(ОписаниеОшибки()); 
	Возврат;
	КонецПопытки;
	Сообщение = Новый ИнтернетПочтовоеСообщение();
	Сообщение.Отправитель = "1cservicesspb@gmail.com";
	Сообщение.ИмяОтправителя = "Maria";
	Сообщение.Получатели.Добавить("mari.aleo@yandex.ru");
	Сообщение.Тема = "Важное сообщение";
	//Сообщение.Тексты.Добавить("Привет, получилось отправить письмо");
	ИнтернетТекстПочтовогоСообщения = Сообщение.Тексты.Добавить();
	ИнтернетТекстПочтовогоСообщения.Текст = "Привет, получилось отправить письмо";
	ИнтернетТекстПочтовогоСообщения.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	
	Попытка
	// Пытаемся послать письмо
	Почта.Послать(Сообщение);
	Исключение
	Сообщить(ОписаниеОшибки()); 
	Возврат;
	КонецПопытки;
	// отключение
	Почта.Отключиться(); 
	
	
	Сообщ = новый СообщениеПользователю();
	Сообщ.Текст = "Проыцедура на сервере завершена";
	Сообщ.Сообщить();
	ПолучитьПрофиль();
КонецПроцедуры

