

&НаКлиенте
Процедура ВыбратьПисьма(Команда)
	ВыбратьПисьмаНаСервере();
КонецПроцедуры

&НаСервере


Функция ПолучитьПрофиль(УчЗапись)
Профиль = Новый ИнтернетПочтовыйПрофиль;
Профиль.АдресСервераSMTP = УчЗапись.СерверSMTP;
Профиль.ПортSMTP = УчЗапись.ПортSMTP;
Профиль.ИспользоватьSSLSMTP = Истина;
Профиль.Пользователь = УчЗапись.АдресЭП;
Профиль.Пароль = УчЗапись.Пароль;
Профиль.ПользовательSMTP = УчЗапись.АдресЭП;
Профиль.ПарольSMTP = УчЗапись.Пароль;
Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
Профиль.ВремяОжидания = 50; 

Возврат Профиль;
КонецФункции



Процедура ВыбратьПисьмаНаСервере()
	//TODO: считывать из очереди 
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	ДатаОтправки = Дата(ТекущаяДата());
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 5
		|	Очередь.Рассылка КАК Рассылка,
		|	Очередь.Контрагент КАК Контрагент,
		|	Очередь.УчетнаяЗаписьЭП КАК УчетнаяЗаписьЭП,
		|	Очередь.ДатаОтправки КАК ДатаОтправки
		|ИЗ
		|	РегистрСведений.Очередь КАК Очередь
		|ГДЕ
		|	Очередь.ДатаОтправки <= &ДатаОтправки
		|ДЛЯ ИЗМЕНЕНИЯ
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОтправки,
		|	Рассылка";
	
	Запрос.УстановитьПараметр("ДатаОтправки", ДатаОтправки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Сообщить("первый профиль");
	//Проф = ПолучитьПрофиль(ВыборкаДетальныеЗаписи.УчетнаяЗаписьЭП);
	Сообщить(ВыборкаДетальныеЗаписи.Количество());

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//Сообщить(АдресЭП);
		
		
		Сообщить("В цикле");
		
		Проф = ПолучитьПрофиль(ВыборкаДетальныеЗаписи.УчетнаяЗаписьЭП);
		Сообщить(Проф.Пользователь);
		//Пароль=  ВыборкаДетальныеЗаписи.УчетнаяЗаписьЭП.Пароль;
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры



Процедура ПодключитьсяКПочте(Профиль)	
	Почта = Новый ИнтернетПочта;
	Попытка
	Почта.Подключиться(Профиль);
	Сообщить("Подключение к профилю прошло успешно");
	Исключение
	Сообщить(ОписаниеОшибки()); 
	Возврат;
	КонецПопытки;
	Сообщение = Новый ИнтернетПочтовоеСообщение();
	Сообщение.Отправитель = "1cservicesspb@gmail.com";
	Сообщение.ИмяОтправителя = "Maria";
	Сообщение.Получатели.Добавить("lawinov2010@yandex.ru");
	//Сообщение.Получатели.Добавить("mari.aleo@yandex.ru");
	//Сообщение.Получатели.Добавить("your@mailbox.com");
	Сообщение.Тема = "Важное сообщение";
	//Сообщение.Тексты.Добавить("Привет, получилось отправить письмо");
	ТекстСообщения = Сообщение.Тексты.Добавить();
	ТекстСообщения.Текст = "<a href=""mailto:1cservicesspb@gmail.com"">Отправьте для отписки от рассылки</a>";
	ТекстСообщения.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;

	Попытка
	Почта.Послать(Сообщение);
	Исключение
	Сообщить(ОписаниеОшибки()); 
	Возврат;
	КонецПопытки;
	Почта.Отключиться(); 
	
	Сообщ = новый СообщениеПользователю();
	Сообщ.Текст = "Процедура на сервере завершена";
	Сообщ.Сообщить();
КонецПроцедуры
